{
    "header": {
        "logo": "site logo",
        "menu_items": {
            "home": "ΑΡΧΙΚΗ",
            "about": "ΣΧΕΤΙΚΑ ΜΕ",
            "tech_stack": "ΤΕΧΝΟΛΟΓΙΕΣ",
            "services": "ΥΠΗΡΕΣΙΕΣ",
            "portfolio": "ΠΟΡΤΦΟΛΙΟ",
            "contact": "ΕΠΙΚΟΙΝΩΝΙΑ"
        },
        "hamburger": {
            "btn": ""
        }
    },
    "home": {
        "heading": "Γειά 👋 είμαι ένας Front-End Web Developer από την Ελλάδα",
        "image_caption": "Μια απλή φωτογραφία μου",
        "cloud_text": "Καλώς ήλθατε στην ιστοσελίδα μου! Είμαι ένας front-end web developer με πάθος για τη δημιουργία εκπληκτικών διαδικτυακών εμπειριών. Ας συνεργαστούμε για να δημιουργήσουμε κάτι όμορφο.",
        "buttons": {
            "contact": "ΕΛΑΤΕ ΣΕ ΕΠΑΦΗ",
            "contact_emoji": "🤙",
            "learn_more": "ΠΟΙΟΣ ΕΙΜΑΙ",
            "learn_more_emoji": "🔎"
        }
    },
    "about": {
        "heading": "ΣΧΕΤΙΚΑ ΜΕ ⚡ ΕΜΕΝΑ",
        "paragraphs": [
            "Όνομάζομαι Πέτρος Σκουλάς και είμαι ένας junior web developer από την Ελλάδα. Μετά την ολοκλήρωση της δευτεροβάθμιας εκπαίδευσης μου στο 9ο Γενικό Λύκειο Αμαρουσίου, σπούδασα Information Technology (IT) στο Αμερικανικό Κολλέγιο Ελλάδος - Deree με εστίαση στο Software Development και αποφοίτησα το 2020. Ήδη πριν την αποφοίτηση μου, είχα ανακαλύψει ότι το web development είναι το αντικείμενο που μου ταιριάζει και έτσι αποφάσισα ότι αυτό θα πρέπει να είναι το επίκεντρο της καριέρας μου.",
            "Έτσι, αμέσως μετα την αποφοίτηση μου, αποφάσισα να εμβαθύνω τις γνώσεις μου στις τεχνολογίες που απαρτίζουν το σημερινό web όπως είναι οι HTML, CSS και JavaScript. Στη συνέχεια αποφάσισα να επικεντρωθώ στην εκμάθηση του React, το οποίο αποτελέι το πιο δημοφιλες front-end library/framework ως τώρα, εξασφαλίζοντας την επαρκή προσαρμογή μου στις πιο σύγχρονες και περίπλοκες ανάγκες του σημερινού τοπίου του front-end web development.",
            "Επιπλέον, καθώς το WordPress αποτελεί το δημοφιλέστερο CMS για την ανάπτυξη ιστοσελίδων παγκοσμίως, ενδιαφέρθηκα για την εις βάθος κατανόηση του. Έτσι, μπορώ να ανταποκριθώ στις ευρύτερες ανάγκες της αγοράς και να προσφέρω προσαρμοσμένες λύσεις οι οποίες να καλύπτουν και τις πιο απαιτητικές ανάγκες, εκμεταλλευόμενος τις τεράστιες δυνατότητες προσαρμογής του WordPress και πάραλληλα αξιοποιώντας τις καλύτερες πρακτικές του front-end development. Έχω ιδιαίτερο ενθουσιασμό για τη κατασκευή εξατομικευμένων θεμάτων WordPress τα οποία διαθέτουν προσαρμοσμένη λειτουργικότητα και ξεχωριστή εμφάνιση, συνδυάζοντας τεχνική ακρίβεια με δημιουργικότητα.",
            "Διαθέτοντας ισχυρά θεμέλια και συνεχή επιθυμία για μάθηση, ανυπομονώ να συνεργαστώ με άλλους και να συμμετέχω στη διαμόρφωση του web development τοπίου μέσω της συνεισφοράς μου."
        ],
        "buttons": {
            "services": "ΒΙΟΓΡΑΦΙΚΟ",
            "portfolio": "ΔΕΞΙΟΤΗΤΕΣ"
        }
    },
    "tech_stack": {
        "title": "ΤΕΧΝΟΛΟΓΙΕΣ & ΕΡΓΑΛΕΙΑ",
        "core_technologies": [
            {
                "title": "ΚΥΡΙΕΣ ΤΕΧΝΟΛΟΓΙΕΣ"
            },
            {
                "technology": "React",
                "description": "Αν και είμαι ακόμα σχετικά νέος στο React, έχω ήδη κατανοήσει τις βασικές έννοιες και τις λειτουργίες του όπως για παράδειγμα τα κύρια React Hooks, το JSX syntax και η αρχιτεκτονική που βασίζεται σε components. Αισθάνομαι αρκετή αυτοπεποίθηση για την ικανότητά μου να αξιοποιώ αποτελεσματικά το React στα project μου, επεκτείνοντας συνεχώς την εμπειρία μου σε κάθε νέο βήμα. Βασικά, αυτός ακριβώς ο ιστότοπος, ο ιστότοπος του πορτφόλιου μου, δημιουργήθηκε με React και δεν μετάνιωσα καθόλου που το χρησιμοποίησα."
            },
            {
                "technology": "JavaScript",
                "description": "Η JavaScript αποτελεί τη γλώσσα πυρήνα του front-end web development. Με την δυναμική της φύση και τις απεριόριστες δυνατότητες που προσφέρει, μου δίνει τη δυνατότητα να δημιουργώ πλήρως διαδραστικές ιστοστελίδες και web apps καθορίζοντας κάθε λεπτομέρεια του τρόπου λειτουργίας τους. Μέσα από πρακτικές εργασίες και συνεχή εκμάθηση, έχω αποκτήσει μια καλή κατανόηση των βασικών εννοιών της JavaScript, από DOM manipulation μέχρι event handling, αξιοποίηση χαρακτηριστικών ES6, χρήση μοντέρνων frameworks καθώς και πολλά άλλα. Όλα μεγάλης σημασίας για την ανάπτυξη ιστοσελίδων υψηλής απόδοσης."
            },
            {
                "technology": "TypeScript",
                "description": "Αν και η εμπειρία μου με την TypeScript είναι ακόμα περιορισμένη, έχω αποκτήσει επαρκή κατανόηση των αρχών και της σύνταξής της. Αισθάνομαι άνετα με το να ενσωματώνω την TypeScript στα projects μου ώστε να επωφελούμαι από τη βελτίωση της ποιότητας και της διατηρησιμότητας του κώδικα μου."
            },
            {
                "technology": "CSS",
                "description": "Η CSS μπορεί να είναι περίεργη (και ακόμη και εκνευριστική) μερικές φορές. Αυτό θα συμβαίνει πάντα και ίσως είναι και μέρος της γοητείας της, αλλά παρά τα περιστασιακά κολλήματα, η CSS παραμένει αναπόσπαστο κομμάτι της ανάπτυξης ιστοσελίδων και ειλικρινά μου αρέσει πολύ να τη δουλεύω. Ήδη κατέχω μια ολοκληρωμένη κατανόηση όλων των βασικών εννοιών και αρχών της. Για εμένα όταν δουλεύω με τη CSS είναι ίσως μια από τις πιο ενδιαφέρουσες πτυχές της δουλειας μου."
            },
            {
                "technology": "Sass (scss)",
                "description": "Ως λάτρης της CSS, βρίσκω ιδαίτερα βολικό το εναλλακτικό syntax του Sass pre-processor (.scss). Αν και δεν συνηθιζω να χρησιμοποιώ τα πιο προχωρημένα features του Sass όπως τα custom functions, εκτιμώ πολύ το nesting capability, τα mixins, τις variables, τα parent prefixes και την καλύτερη οργάνωση των αρχείων που μου προσφέρει το Sass."
            },
            {
                "technology": "HTML",
                "description": "Η HTML αποτελεί το πιο βασικό θεμέλιο για την ανάπτυξη οποιασδήποτε ιστοσελίδας ή web app. Αν και λόγω της μεγάλης απλότητας της, αρκετοί ίσως δεν δίνουν τη βάση που θα έπρεπε, εγώ εκτιμώ βαθιά τον ουσιώδη ρόλο της στο web development και προσπαθώ να γράφω HTML που να συμμορφώνεται πλήρως με τις βέλτιστες πρακτικές για τη διασφάλιση της καλύτερης προσβασιμότητας, λιγότερης αταξίας στο markup καθώς  και για του επίτευξη καλύτερου technical SEO κάνωντας κατάλληλη χρήση των διαφόρων semantinc HTML tags."
            },
            {
                "technology": "WordPress",
                "description": "Είμαι αρκετά εξοικειωμένος με τις αρχές λειτουργίας ενός WordPress Theme ή plugin. Πιο συγκεκριμενα, γνωρίζω για την ανάπτυξη θεμάτων, πως λειτουργούν τα διάφορα hooks και το template hierarchy, τα custom fields, τα custom post types, τα custom taxonomies, τα custom queries, το REST API, καθώς και τα βασικά του Woocommerce. Γνωρίζω επίσης πως λειτουργεί ο block editor (Gutenberg) καθώς και το block theme development με full site editing ενώ παράλληλα διαθέτω μια πολύ βασίκη κατανόηση γύρω από τη δημιουργία custom blocks."
            },
            {
                "technology": "PHP",
                "description": "Αν και ακόμα δεν θεωρώ τον εαυτό μου backend ή full-stack web developer, η επάρκειά μου στην PHP, ιδιαίτερα σε ότι έχει σχέση με το WordPress ecosystem, είναι απόλυτα ικανοποιητική. Αν και δεν έχω ασχοληθεί με τη δημιουργία ένος backend για web apps, κατέχω καλά τις βασικές αρχές της PHP, τη σύνταξη και τις ιδιαιτερότητές της. Αυτό το επίπεδο γνώσης μου αρκεί απόλυτα ώστε να μπορώ να χρησιμοποιώ την PHP για ανάπτυξη WordPress θεμάτων και plugins χωρίς καμία δυσκολία."
            }
        ],
        "workflow_tools": [
            {
                "title": "ΕΡΓΑΛΕΙΑ"
            },
            {
                "technology": "NPM & Σχετικά Εργαλεία",
                "description": "Σε σχεδόν κάθε μου εργασία, εχώ χρησιμοποιήσει το NPM μέσω του command line interface για την εγκατάσταση πολύτιμων εργαλείων, όπως σύγχρονα workflow tools και bundlers σαν το Webpack, το Parcel και το Vite καθώς και διάφορα dependencies ανάλογα με το κάθε project. Μέσα από τη χρήση όλων αυτών των εργαλείων, έχω αποκτήσει βαθιά κατανόηση σχετικά με τον τρόπο λειτουργίας τους καθώς και για την καθοριστική τους σημασία στην επίτευξη αποδοτικότερου development. Με τη χρήση αυτών των εργαλείων, είμαι σε θέση να παράγω κώδικα που ανταποκρίνεται στις υψηλές προδιαγραφές των επαγγελματικών projects."
            },
            {
                "technology": "Version Control | Git & Github",
                "description": "Άλλο ένα πολύ σημαντικό εργαλείο για βέλτιστη παραγωγικότητα καθώς και για την καλύτερη συνεργασία εντός μιας ομάδας είναι το Version Control και πιο συγκεκριμένα το Git και το GitHub. Αναγνωρίζοντας την ουσιαστική σημασία του version control, φροντίζω να τα ενσωματώνω σε όλα τα projects μου, ανεξάρτητα από το μέγεθός τους. Έχοντας αποκτήσει εμπειρία γύρω από τις βασικες λειτουργίες των Git και GitHub, αισθάνομαι αυτοπεποίθηση στο να διαχειρίζομαι τις αλλαγές στον κώδικά μου με ευκολία και να διατηρώ υψηλό επίπεδο συνεργασίας σε κάθε project."
            }
        ],
        "college_education": [
            {
                "title": "ΚΟΛΕΓΙΑΚΗ ΕΚΠΑΙΔΕΥΣΗ"
            },
            {
                "technology": "Python & Django",
                "description": "Μπορεί προς το παρόν να μην εστιάζω το ενδιαφέρον μου στην Python, το Django ή γενικότερα στο backend development, αξίζει όμως να αναφέρω ότι ως πτυχιακή εργασία (capstone project) κατά την αποφοίτηση μου είχα επιλέξει να κατασκευάσω ένα blogging CMS και για την υλοποίηση του, είχα επιλέξει το  Django Python framework. Αν και πλέον η εστίασή μου βρίσκεται αλλού, αυτή η εμπειρία ήταν ανεκτίμητη καθώς ενίσχισε την ικανότητά μου να προσαρμόζομαι ταχέως σε διάφορες νέες προκλήσεις."
            },
            {
                "technology": "SQL Databases",
                "description": "Αν και προς το παρόν επικεντρώνομαι πρωτίστως στην εξέλιξη μου ως Front-end web developer, ως μέρος του ακαδημαϊκού προγράμματος σπουδών μου έλαβα εκπαίδευση μου προσέφερε πολύτιμες γνώσεις σχετικά με τις relational βάσεις δεδομένων (relational database management systems (RDBMS)). Πιο συγκεκριμένα διδάχτηκα βασικές αρχές του σχεδιασμού των βάσεων δεδομένων καθώς και για τις διάφορες εντολές με τις οποίες διαχειριζόμαστε μια βάση δεδομένων."
            },
            {
                "technology": "Διάφορα Software Development ProjectsS",
                "description": "Καθ' όλη τη διάρκεια των σπουδών μου, ανέλαβα διάφορες εργασίες ανάπτυξης λογισμικού, που εκτείνονταν σε web apps, mobile apps, desktop apps, καθώς ακόμη και βιντεοπαιχνίδια. Αυτές οι εργασίες με έφεραν σε επαφή με ένα πλήθος γλωσσών και περιβαλλόντων προγραμματισμού, όπως Java, C, C#, Python, PHP, JavaScript, Android Studio και Unity. Μέσα από την πρακτική εμπειρία που είχα σε όλα αυτά τα διαφορετικά περιβάλλοντα, μπόρεσα να διευρύνω τις δεξιότητες μου και κυρίως απέκτησα μεγαλύτερη ευελιξία ως προγραμματιστής, προετοιμάζοντάς με να αντιμετωπίσω ένα ευρύτερο φάσμα προκλήσεων στο συνεχώς εξελισσόμενο τεχνολογικό τοπίο που υπάρχει."
            }
        ]
    },
    "services": {
        "title": "ΥΠΗΡΕΣΙΕΣ",

        "front_end_development": {
            "title": "Front-end Web Development",
            "heading": "ΥΠΗΡΕΣΙΕΣ ΣΕ ΛΕΠΤΟΜΕΡΕΙΑ:",
            "details": [
                "HTML & CSS / Sass",
                "JavaScript & TypeScript",
                "React",
                "Web APIs",
                "REST APIs",
                "Code optimization",
                "Unit testing"
            ]
        },
        "css_specific_projects": {
            "title": "Ειδικά Projects σε CSS",
            "heading": "ΥΠΗΡΕΣΙΕΣ ΣΕ ΛΕΠΤΟΜΕΡΕΙΑ:",
            "details": [
                "Figma μετατροπή σε HTML & CSS",
                "Κατασκευή στατικής ιστοσελίδας",
                "CSS Grid & Flexbox layout building",
                "CSS bug fixes",
                "CSS Keyframe animations",
                "Responsive web design"
            ]
        },
        "wordpress_development": {
            "title": "Ανάπτυξη στο WordPress",
            "heading": "ΥΠΗΡΕΣΙΕΣ ΣΕ ΛΕΠΤΟΜΕΡΕΙΑ:",
            "details": [
                "Bespoke classic theme development",
                "HTML/Figma to WordPress theme",
                "Block theme development",
                "WooCommerce development",
                "Website tweaks w/ child theme",
                "Plugin development",
                "Custom block development"
            ]
        }
    },
    "portfolio": {
        "section_heading": "ΤΟ ΠΟΡΤΦΟΛΙΟ ΜΟΥ",
        "practice_projects": {
            "subheading": "ΕΡΓΑΣΙΕΣ ΕΞΑΣΚΗΣΗΣ",
            "projects": [
                {
                    "name": "Παιχνίδι Τρίλιζας",
                    "description": "Ένα μικρό παιχνίδι ανεπτυγμένο με vanilla JavaScript",
                    "github": "Προβολή @ Github"
                },
                {
                    "name": "Αναλογικό Ρολόι",
                    "description": "Ένα αναλογικό ρολόι ανεπτυγμένο με Vanilla JavaScript",
                    "github": "Προβολή @ Github"
                },
                {
                    "name": "Εφαρμογή Calorie Tracker",
                    "description": "Vanilla JS app για καταμέτρηση καθημερινών θερμίδων",
                    "github": "Προβολή @ Github"
                },
                {
                    "name": "Παιχνίδι Υπολογισμών",
                    "description": "React app για εξάσκηση στους μαθηματικούς υπολογισμούς",
                    "github": "Προβολή @ Github"
                },
                {
                    "name": "Εφαρμογή Todo",
                    "description": "Εφαρμογή React για καταγραφή καθημερινών tasks (\"todos\")",
                    "github": "Προβολή @ Github"
                },
                {
                    "name": "Θέμα για το WordPress",
                    "description": "Ένα ημιτελές project για να πειραματιστώ με το WordPress",
                    "github": "Προβολή @ Github"
                },
                {
                    "name": "Το Capstone Project μου",
                    "description": "Ένα CMS ανεπτυγμένο με το Python Django framework (2020)",
                    "github": "Προβολή @ Github"
                },
                {
                    "name": "Το site-χαρτοφυλάκιο μου",
                    "description": "Το παρόν site. Αναπτύχθηκε με HTML, Sass και React",
                    "github": "Προβολή @ Github"
                }
            ]
        },
        "gh_profile": "ΕΠΙΣΚΕΨΗ ΠΡΟΦΙΛ GITHUB"
    },

    "contact": {
        "label": "Πέτρος Σκουλάς",
        "section_heading": "ΕΠΙΚΟΙΝΩΝΙΑ",
        "contact_media_heading": "Μέσα Επικοινωνίας",
        "email_label": "E-mail ",
        "phone_label": "Κινητό Τηλέφωνο ",
        "im_label": "Άμεσα μηνύματα ",
        "social_label": "Κοινωνικά Δίκτυα ",
        "website": "Ιστοσελίδα ",
        "form_use": "Φόρμα Επικοινωνίας",
        "form_heading": "Στείλτε μου Μήνυμα",
        "form_name_label": "Όνομα: ",
        "form_name_placeholder": "Γράψτε εδώ το όνομά σας",
        "form_email_label": "Διεύθυνση E-mail: ",
        "form_email_placeholder": "email@domain.com",
        "form_message_label": "Μήνυμα: ",
        "form_message_placeholder": "Γράψτε εδώ το μήνυμά σας",
        "form_submit_label": "Υποβολή",
        "form_cancel_label": "Ακύρωση"
    },

    "footer": {
        "backbtn": "ΠΙΣΩ ΣΤΗΝ ΑΡΧΗ",
        "copyright": "Πέτρος Σκουλάς. Ολα τα δικαιώματα διατηρούνται."
    },

    "legal": {
        "modal": {
            "title": "Όροι χρήσης 📋",
            "par0": "Καλώς ήρθατε στο",
            "par1": "Πριν προχωρήσετε, διαβάστε τους [termsLink] μας. Χρησιμοποιώντας αυτόν τον ιστότοπο, συμφωνείτε με αυτούς τους Όρους Χρήσης και την [privacyLink] μας. Ενδέχεται να συλλέξουμε τα προσωπικά σας στοιχεία μέσω της φόρμας επικοινωνίας, όπως περιγράφεται στις πολιτικές μας. Συνεχίζοντας, συναινείτε στη συλλογή, χρήση και κοινή χρήση των δεδομένων σας σύμφωνα με την Πολιτική Απορρήτου.",
            "items": [
                {
                    "number": "1",
                    "content": "<strong>Χρήση Περιεχομένου:</strong> Το περιεχόμενο σε αυτόν τον ιστότοπο είναι μόνο για ενημερωτικούς σκοπούς. Δεν μπορείτε να αναπαράγετε, να τροποποιήσετε ή να διανείμετε οποιοδήποτε μέρος του περιεχομένου χωρίς την προηγούμενη γραπτή συγκατάθεσή μας."
                },
                {
                    "number": "2",
                    "content": "<strong>Πολιτική Απορρήτου:</strong> Η Πολιτική Απορρήτου μας περιγράφει πώς συλλέγουμε, χρησιμοποιούμε και προστατεύουμε τα προσωπικά σας στοιχεία. Χρησιμοποιώντας τον ιστότοπό μας, αναγνωρίζετε και συμφωνείτε με την Πολιτική Απορρήτου μας."
                },
                {
                    "number": "3",
                    "content": "<strong>Αποποίηση ευθύνης:</strong> Οι πληροφορίες που παρέχονται σε αυτόν τον ιστότοπο προορίζονται μόνο για γενικούς ενημερωτικούς σκοπούς. Δεν κάνουμε καμία δήλωση ή εγγύηση κανενός είδους, ρητή ή σιωπηρή."
                }
            ],
            "buttons": {
                "accept": "ΑΠΟΔΟΧΗ",
                "decline": "ΑΡΝΗΣΗ"
            }
        },
        "privacy": {
            "title": "Πολιτική Απορρήτου",
            "par0": "Καλώς ήρθατε στο",
            "par1": "Αυτή η Πολιτική Απορρήτου περιγράφει πώς συλλέγουμε, χρησιμοποιούμε και προστατεύουμε τα προσωπικά σας στοιχεία όταν χρησιμοποιείτε τον ιστότοπό μας ή υποβάλλετε τα στοιχεία σας μέσω της φόρμας επικοινωνίας.",
            "items": [
                {
                    "title": "Πληροφορίες που συλλέγουμε:",
                    "content": "Ενδέχεται να συλλέξουμε προσωπικές πληροφορίες όπως το όνομά σας, τη διεύθυνση email σας και άλλα στοιχεία επικοινωνίας όταν τα παρέχετε μέσω της φόρμας επικοινωνίας ή άλλων αλληλεπιδράσεων στον ιστότοπό μας."
                },
                {
                    "title": "Πώς χρησιμοποιούμε τις πληροφορίες σας:",
                    "content": " Χρησιμοποιούμε τις πληροφορίες που συλλέγουμε για να παρέχουμε και να βελτιώσουμε τις υπηρεσίες μας, να επικοινωνήσουμε μαζί σας και να εκπληρώσουμε τα αιτήματά σας."
                },
                {
                    "title": "Κοινή χρήση πληροφοριών:",
                    "content": "Δεν πουλάμε, εμπορευόμαστε ή με άλλο τρόπο μεταβιβάζουμε τα προσωπικά σας στοιχεία σε τρίτους χωρίς τη συγκατάθεσή σας. Ωστόσο, ενδέχεται να μοιραστούμε τις πληροφορίες σας με αξιόπιστους παρόχους υπηρεσιών που μας βοηθούν στη λειτουργία του ιστότοπού μας ή στη διεξαγωγή της επιχείρησής μας."
                },
                {
                    "title": "Cookies:",
                    "content": "Ενδέχεται να χρησιμοποιήσουμε cookies και παρόμοιες τεχνολογίες παρακολούθησης για να βελτιώσουμε την εμπειρία σας στον ιστότοπό μας. Μπορείτε να ρυθμίσετε το πρόγραμμα περιήγησής σας ώστε να αρνείται όλα ή ορισμένα cookie του προγράμματος περιήγησης ή να σας ειδοποιεί όταν οι ιστότοποι ορίζουν ή έχουν πρόσβαση σε cookie. Εάν απενεργοποιήσετε ή αρνηθείτε τα cookies, σημειώστε ότι ορισμένα μέρη αυτού του ιστότοπου ενδέχεται να μην είναι προσβάσιμα ή να μην λειτουργούν σωστά."
                },
                {
                    "title": "Αλλαγές σε αυτήν την Πολιτική Απορρήτου:",
                    "content": "Διατηρούμε το δικαίωμα να ενημερώσουμε ή να αλλάξουμε την Πολιτική Απορρήτου μας ανά πάσα στιγμή. Οποιεσδήποτε αλλαγές θα ισχύουν αμέσως μετά τη δημοσίευση της ενημερωμένης Πολιτικής Απορρήτου σε αυτήν τη σελίδα."
                },
                {
                    "title": "Επικοινωνήστε μαζί μας:",
                    "content": "Εάν έχετε οποιαδήποτε ερώτηση σχετικά με την Πολιτική Απορρήτου μας, επικοινωνήστε μαζί μας στη διεύθυνση skoulasp@gmail.com."
                }
            ]
        },
        "terms": {
            "title": "Οροι χρήσης",
            "par0": "Καλώς ήρθατε στο",
            "par1": "Αυτοί οι Όροι Χρήσης διέπουν τη χρήση του ιστότοπού μας από εσάς. Με την πρόσβαση ή τη χρήση του ιστότοπού μας, συμφωνείτε να συμμορφώνεστε με αυτούς τους όρους και προϋποθέσεις.",
            "items": [
                {
                    "title": "Χρήση Περιεχομένου:",
                    "content": "Το περιεχόμενο σε αυτόν τον ιστότοπο είναι μόνο για ενημερωτικούς σκοπούς. Μπορείτε να προβάλετε, να κατεβάσετε και να εκτυπώσετε σελίδες από τον ιστότοπο μόνο για προσωπική, μη εμπορική χρήση."
                },
                {
                    "title": "Απαγορευμένες Δραστηριότητες:",
                    "content": "Συμφωνείτε να μην εμπλέκεστε σε μη εξουσιοδοτημένες ή παράνομες δραστηριότητες στον ιστότοπό μας, συμπεριλαμβανομένης, ενδεικτικά, της προσπάθειας απόκτησης μη εξουσιοδοτημένης πρόσβασης στα συστήματα ή τα δίκτυά μας, παρέμβαση στην ομαλή λειτουργία του ιστότοπου ή παραβίαση οποιωνδήποτε νόμων ή κανονισμών."
                },
                {
                    "title": "Πνευματική Ιδιοκτησία:",
                    "content": "Όλο το περιεχόμενο, τα εμπορικά σήματα και άλλα δικαιώματα πνευματικής ιδιοκτησίας σε αυτόν τον ιστότοπο αποτελούν ιδιοκτησία του Πέτρου Σκουλά ή των αντίστοιχων κατόχων τους. Δεν μπορείτε να χρησιμοποιήσετε, να αναπαράγετε ή να διανείμετε οποιοδήποτε περιεχόμενο από αυτόν τον ιστότοπο χωρίς προηγούμενη γραπτή άδεια."
                },
                {
                    "title": "Περιορισμός ευθύνης:",
                    "content": "Προσπαθούμε να παρέχουμε ακριβείς και ενημερωμένες πληροφορίες στον ιστότοπό μας, αλλά δεν παρέχουμε καμία δήλωση ή εγγύηση οποιουδήποτε είδους, ρητή ή σιωπηρή, σχετικά με την πληρότητα, την ακρίβεια, την αξιοπιστία, την καταλληλότητα ή τη διαθεσιμότητα των πληροφοριών , προϊόντα, υπηρεσίες ή σχετικά γραφικά που περιέχονται στον ιστότοπο."
                },
                {
                    "title": "Αλλαγές στους Όρους Χρήσης:",
                    "content": "Διατηρούμε το δικαίωμα να ενημερώσουμε ή να τροποποιήσουμε αυτούς τους Όρους Χρήσης ανά πάσα στιγμή χωρίς προηγούμενη ειδοποίηση. Η συνέχιση της χρήσης του ιστότοπου μετά από οποιεσδήποτε τέτοιες αλλαγές συνιστά αποδοχή των νέων όρων."
                },
                {
                    "title": "Επικοινωνήστε μαζί μας:",
                    "content": "Εάν έχετε οποιαδήποτε ερώτηση σχετικά με τους Όρους Χρήσης μας, επικοινωνήστε μαζί μας στη διεύθυνση skoulasp@gmail.com."
                }
            ]
        },
        "credits": {
            "title": "Συντελεστές Φωτογραφιών",
            "par1": "Σας ευχαριστώ που επισκεφτήκατε τον προσωπικό μου ιστότοπο. Προσπαθώ να διασφαλίσω ότι όλες οι εικόνες που χρησιμοποιούνται σε αυτόν τον ιστότοπο συμμορφώνονται με τις ισχύουσες άδειες και κανονισμούς. Αν και έχω καταβάλει κάθε δυνατή προσπάθεια να χρησιμοποιήσω εικόνες που είναι δωρεάν και φέρουν ετικέτα με άδειες Creative Commons, αναγνωρίζω ότι μπορεί να μην κατάφερα να εντοπίσω τις ακριβείς πηγές ή να παράσχω απόδοση στους δημιουργόυς αυτών των εικόνων.",
            "par2": "Εάν είστε ο κάτοχος οποιασδήποτε εικόνας που εμφανίζεται σε αυτόν τον ιστότοπο και θέλετε να αφαιρεθεί ή να πιστωθεί σωστά, αποδεχτείτε την ειλικρινή μου συγγνώμη. Οι ανησυχίες σας είναι υψίστης σημασίας για μένα και δεσμεύομαι να επιλύσω τυχόν προβλήματα εγκαίρως.",
            "par3": "Επικοινωνήστε μαζί μου μέσω email στο skoulasp@gmail.com με λεπτομέρειες σχετικά με την εν λόγω εικόνα και θα προβώ άμεσα σε ενέργειες για να ανταποκριθώ στο αίτημά σας.",
            "par4": "Σας ευχαριστώ για την κατανόηση και τη συνεργασία σας."
        }
    }
}
